tests/requests/wps_getcapabilities_request_SOAP12.xml

<?xml version="1.0" encoding="UTF-8"?>
	<!-- WPS GetCapabilities request using soap version 1.2-->
	<!--
		Equivalent GET request is
		http://foo.bar/foo?Service=WPS&Version=1.0.0&Request=GetCapabilities&Language=en-CA
	-->
	<!-- SOAP version 1.2 http://www.w3.org/TR/soap12-part0/ -->
	<!--  http://en.wikipedia.org/wiki/SOAP -->
	<!--  No header present in request -->
<soap:Envelope xmlns:soap="http://www.w3.org/2003/05/soap-envelope"
	xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"
	xsi:schemaLocation="http://www.w3.org/2003/05/soap-envelope
	http://www.w3.org/2003/05/soap-envelope">
	<soap:Body>
		<wps:GetCapabilities xmlns:ows="http://www.opengis.net/ows/1.1"
			xmlns:wps="http://www.opengis.net/wps/1.0.0" xmlns:xlink="http://www.w3.org/1999/xlink"
			xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"
			xsi:schemaLocation="http://www.opengis.net/wps/1.0.0 ../wpsGetCapabilities_request.xsd" service="WPS">
			<wps:AcceptVersions>
				<ows:Version>1.0.0</ows:Version>
			</wps:AcceptVersions>
		</wps:GetCapabilities>
	</soap:Body>
</soap:Envelope>
