tests/requests/wps_execute_request_ultimatequestion_SOAP.xml

<?xml version="1.0" encoding="UTF-8" standalone="yes"?>
<!-- Execute operation request assuming use of default formats, and RawDataOutput.-->
<!-- Equivalent GET request is service=wps&request=execute&version=1.0.0&identifier=ultimatequestionprocess&status=true&storeExecuteResponse=true-->
<SOAP-ENV:Envelope 
	xmlns:SOAP-ENC="http://schemas.xmlsoap.org/soap/encoding/" xmlns:xsi="http://www.w3.org/1999/XMLSchema-instance"
	xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsd="http://www.w3.org/1999/XMLSchema">
	<SOAP-ENV:Body>
<wps:Execute service="WPS" version="1.0.0" xmlns:wps="http://www.opengis.net/wps/1.0.0" xmlns:ows="http://www.opengis.net/ows/1.1" xmlns:xlink="http://www.w3.org/1999/xlink" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xsi:schemaLocation="http://www.opengis.net/wps/1.0.0/wpsExecute_request.xsd">
	<ows:Identifier>ultimatequestionprocess</ows:Identifier>
	<wps:ResponseForm>
                <wps:ResponseDocument lineage="false" storeExecuteResponse="true" status="true" />
	</wps:ResponseForm>
</wps:Execute>
</SOAP-ENV:Body>
</SOAP-ENV:Envelope>