tests/requests/wps_describeprocess_request_all_SOAP.xml

<SOAP-ENV:Envelope xmlns:SOAP-ENC="http://schemas.xmlsoap.org/soap/encoding/"
	xmlns:xsi="http://www.w3.org/1999/XMLSchema-instance" xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/"
	xmlns:xsd="http://www.w3.org/1999/XMLSchema">
	<SOAP-ENV:Body>
		<DescribeProcess xmlns="http://www.opengis.net/wps/1.0.0"
			xmlns:ows="http://www.opengis.net/ows/1.1" xmlns:xlink="http://www.w3.org/1999/xlink"
			xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"
			xsi:schemaLocation="http://www.opengis.net/wps/1.0.0 ..\wpsDescribeProcess_request.xsd"
			service="WPS" version="1.0.0" language="en">
			<ows:Identifier>all</ows:Identifier>
		</DescribeProcess>
	</SOAP-ENV:Body>
</SOAP-ENV:Envelope>