tests/requests/wps_getcapabilities_request_SOAP11.xml

<?xml version="1.0" encoding="UTF-8"?>
	<!-- WPS GetCapabilities request using soap version 1.1-->
	<!--
		Equivalent GET request is
		http://foo.bar/foo?Service=WPS&Version=1.0.0&Request=GetCapabilities&Language=en-CA
	-->
	<!--
		SOAP version 1.1
		http://www.w3.org/TR/2000/NOTE-SOAP-20000508/#_Toc478383539
	-->
	<!--  No header present  -->
<SOAP-ENV:Envelope
	xmlns:SOAP-ENC="http://schemas.xmlsoap.org/soap/encoding/" xmlns:xsi="http://www.w3.org/1999/XMLSchema-instance"
	xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsd="http://www.w3.org/1999/XMLSchema">
	<SOAP-ENV:Body>
		<wps:GetCapabilities xmlns:ows="http://www.opengis.net/ows/1.1"
			xmlns:wps="http://www.opengis.net/wps/1.0.0" xmlns:xlink="http://www.w3.org/1999/xlink"
			xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"
			xsi:schemaLocation="http://www.opengis.net/wps/1.0.0 ../wpsGetCapabilities_request.xsd"
			language="en" service="WPS">
			<wps:AcceptVersions>
				<ows:Version>1.0.0</ows:Version>
			</wps:AcceptVersions>
		</wps:GetCapabilities>
	</SOAP-ENV:Body>
</SOAP-ENV:Envelope>


