tests/requests/wps_describeprocess_request_SOAP11RPC.xml

<?xml version="1.0" encoding="UTF-8"?>
<SOAP-ENV:Envelope xmlns:ns0="http://www.opengis.net/wps/1.0.0" xmlns:ns1="http://schemas.xmlsoap.org/soap/envelope/" xmlns:ns2="http://www.opengis.net/ows/1.1" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/">
   <SOAP-ENV:Header/>
   <ns1:Body>
      <ns0:DescribeProcess>
         <ns2:Identifier xsi:type="ns2:CodeType">ultimatequestionprocess</ns2:Identifier>
      </ns0:DescribeProcess>
   </ns1:Body>
</SOAP-ENV:Envelope>